doc/html/elements/droppable.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Droppable Element Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-06-14 18:35:19 EDT"/>
<meta name="author" content="Rusty Klophaus (@rklophaus)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />
</head>
<body>
<div id="content">

<h1 class="title">Droppable Element Element</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | Elements | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html">Handlers</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Droppable Element </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Droppable Element </h2>
<div class="outline-text-2" id="text-1">


<p>
The droppable element allows you to make a block of Nitrogen elements a drop target for draggable elements.
</p>
<p>
Combine the draggable element with the droppable element to allow drag and drop behavior.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Usage </h3>
<div class="outline-text-3" id="text-1.1">





<pre class="src src-erlang">#<span style="color: #28439B;">droppable</span> { tag=drop1, accept_class=accept, hover_class=hover, body=[
  #<span style="color: #28439B;">span</span> { text=<span style="color: #09A240;">"This is a droppable block."</span> }
]}
</pre>




</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Attributes </h3>
<div class="outline-text-3" id="text-1.2">


<dl>
<dt>tag - (<i>Erlang term</i>)</dt><dd>
The drag term to pass into the drop_event/2 event.

</dd>
<dt>body - (<i>Nitrogen elements</i>)</dt><dd>
The elements that will be droppable.

</dd>
<dt>accept_groups - (<i>list of atoms (defaults to 'all')</i>)</dt><dd>
The drag groups that will be accepted by this drop target

</dd>
<dt>active_class - (<i>atom or string (defaults to 'active')</i>)</dt><dd>
This CSS class will be applied to the element when the user drags a draggable element.

</dd>
<dt>hover_class - (<i>atom or string (defaults to 'hover')</i>)</dt><dd>
This CSS class will be applied to the element when the user hovers with a draggable element.

</dd>
</dl>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Events </h3>
<div class="outline-text-3" id="text-1.3">



</div>

<div id="outline-container-1.3.1" class="outline-4">
<h4 id="sec-1.3.1"><span class="section-number-4">1.3.1</span> drop<sub>event</sub>(DragTag, DropTag) </h4>
<div class="outline-text-4" id="text-1.3.1">


<p>
Called when the user drops an element. DragTag is the tag associated with the draggable element. DropTag is the tag associated with the droppable element.
</p>
</div>
</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> See Also </h3>
<div class="outline-text-3" id="text-1.4">


<ul>
<li>
<a href="./draggable.html">draggable element</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Rusty Klophaus (@rklophaus)
<a href="mailto:">&lt;&gt;</a>
</p>
<p class="date"> Date: 2010-06-14 18:35:19 EDT</p>
<p class="creator">HTML generated by org-mode 6.33f in emacs 22</p>
</div>
</div>
</body>
</html>
